stm32duino/Arduino_Core_STM32/system/Drivers/STM32U0xx_HAL_Driver/Src/stm32u0xx_hal_pwr_ex.c
  return status;
}

#if defined(USB_DRD_FS)
/**
  * @brief Enable VDDUSB supply.
  * @note  Remove VDDUSB electrical and logical isolation, once VDDUSB supply is present.
  * @retval None
  */
void HAL_PWREx_EnableVddUSB(void)
{
  SET_BIT(PWR->CR2, PWR_CR2_USV);
}

/**
  * @brief Disable VDDUSB supply.
  * @retval None
  */
void HAL_PWREx_DisableVddUSB(void)
{
  CLEAR_BIT(PWR->CR2, PWR_CR2_USV);
}
#endif /* USB_DRD_FS */

/**
  * @brief Enable battery charging.
  *        When VDD is present, charge the external battery on VBAT through an internal resistor.
  * @param  ResistorSelection specifies the resistor impedance.
  *          This parameter can be one of the following values:
  *            @arg @ref PWR_BATTERY_CHARGING_RESISTOR_5     5 kOhms resistor
  *            @arg @ref PWR_BATTERY_CHARGING_RESISTOR_1_5 1.5 kOhms resistor
  * @retval None
  */
void HAL_PWREx_EnableBatteryCharging(uint32_t ResistorSelection)
{
  assert_param(IS_PWR_BATTERY_RESISTOR_SELECT(ResistorSelection));

  /* Specify resistor selection */
  MODIFY_REG(PWR->CR4, PWR_CR4_VBRS, ResistorSelection);

  /* Enable battery charging */
  SET_BIT(PWR->CR4, PWR_CR4_VBE);
}

/**
  * @brief Disable battery charging.
  * @retval None
  */
void HAL_PWREx_DisableBatteryCharging(void)
{
  CLEAR_BIT(PWR->CR4, PWR_CR4_VBE);
}
/**
  * @brief This function handles the PWR PVD/PVMx interrupt request.
  * @note This API should be called under the PVD_PVM_IRQHandler().
  * @retval None
  */
void HAL_PWREx_PVD_PVM_IRQHandler(void)
{
  /* Check if the Programmable Voltage Detector is enabled (PVD) */
  if (READ_BIT(PWR->CR2, PWR_CR2_PVDE) != 0U)
  {
    /* Check PWR EXTI Rising flag */
    if (__HAL_PWR_PVD_EXTI_GET_RISING_FLAG() != 0U)
    {
      /* PWR PVD interrupt user callback */
      HAL_PWR_PVDCallback();

      /* Clear PWR EXTI pending bit */
      __HAL_PWR_PVD_EXTI_CLEAR_FLAG();
    }

    /* Check PWR EXTI Falling flag */
    if (__HAL_PWR_PVD_EXTI_GET_FALLING_FLAG() != 0U)
    {
      /* PWR PVD interrupt user callback */
      HAL_PWR_PVDCallback();

      /* Clear PWR EXTI pending bit */
      __HAL_PWR_PVD_EXTI_CLEAR_FLAG();
    }
  }

  /* Next, successively check PVMx exti flags */
#if defined(USB_DRD_FS)
  if (READ_BIT(PWR->CR2, PWR_PVM_1) != 0U)
  {
    /* Check PWR EXTI Rising flag */
    if (__HAL_PWR_PVM1_EXTI_GET_RISING_FLAG() != 0U)
    {
      /* PWR PVM interrupt user callback */
      HAL_PWREx_PVM1_Callback();

      /* Clear PWR EXTI pending bit */
      __HAL_PWR_PVM1_EXTI_CLEAR_FLAG();
    }

    /* Check PWR EXTI Falling flag */
    if (__HAL_PWR_PVM1_EXTI_GET_FALLING_FLAG() != 0U)
    {
      /* PWR PVM USB interrupt user callback */
      HAL_PWREx_PVM1_Callback();

      /* Clear PWR EXTI pending bit */
      __HAL_PWR_PVM1_EXTI_CLEAR_FLAG();
    }
  }
#endif /* USB_DRD_FS */
  if (READ_BIT(PWR->CR2, PWR_PVM_3) != 0U)
  {
    /* Check PWR EXTI Rising flag */
    if (__HAL_PWR_PVM3_EXTI_GET_RISING_FLAG() != 0U)
    {
      /* PWR PVM interrupt user callback */
      HAL_PWREx_PVM3_Callback();

      /* Clear PWR EXTI pending bit */
      __HAL_PWR_PVM3_EXTI_CLEAR_FLAG();
    }

    /* Check PWR EXTI Falling flag */
    if (__HAL_PWR_PVM3_EXTI_GET_FALLING_FLAG() != 0U)
    {
      /* PWR PVM ADC interrupt user callback */
      HAL_PWREx_PVM3_Callback();

      /* Clear PWR EXTI pending bit */
      __HAL_PWR_PVM3_EXTI_CLEAR_FLAG();
    }
  }

  if (READ_BIT(PWR->CR2, PWR_PVM_4) != 0U)
  {
    /* Check PWR EXTI Rising flag */
    if (__HAL_PWR_PVM4_EXTI_GET_RISING_FLAG() != 0U)
    {
      /* PWR PVM interrupt user callback */
      HAL_PWREx_PVM4_Callback();

      /* Clear PWR EXTI pending bit */
      __HAL_PWR_PVM4_EXTI_CLEAR_FLAG();
    }

    /* Check PWR EXTI Falling flag */
    if (__HAL_PWR_PVM4_EXTI_GET_FALLING_FLAG() != 0U)
    {
      /* PWR PVM4 for DAC interrupt user callback */
      HAL_PWREx_PVM4_Callback();

      /* Clear PWR EXTI pending bit */
      __HAL_PWR_PVM4_EXTI_CLEAR_FLAG();
    }
  }
}

#if defined(USB_DRD_FS)
/**
  * @brief PWR PVM USB interrupt callback
  * @retval None
  */
__weak void HAL_PWREx_PVM1_Callback(void)
{
  /* NOTE : This function should not be modified; when the callback is needed,
            HAL_PWREx_PVM_USBCallback() API can be implemented in the user file
   */
}
#endif /* USB_DRD_FS */

/**
  * @brief PWR PVM ADC interrupt callback
  * @retval None
  */
__weak void HAL_PWREx_PVM3_Callback(void)
{
  /* NOTE : This function should not be modified; when the callback is needed,
            HAL_PWREx_PVM_ADCCallback() API can be implemented in the user file
   */
}

/**
  * @brief PWR PVM DAC interrupt callback
  * @retval None
  */
__weak void HAL_PWREx_PVM4_Callback(void)
{
  /* NOTE : This function should not be modified; when the callback is needed,
            HAL_PWREx_PVM_DACCallback() API can be implemented in the user file
   */
}

/**
  * @brief Enable Internal Wake-up Line.
  * @retval None
  */
void HAL_PWREx_EnableInternalWakeUpLine(void)
{
  SET_BIT(PWR->CR3, PWR_CR3_EIWUL);
}

/**
  * @brief Disable Internal Wake-up Line.
  * @retval None
  */
void HAL_PWREx_DisableInternalWakeUpLine(void)
{
  CLEAR_BIT(PWR->CR3, PWR_CR3_EIWUL);
}
/**
  * @}
  */

/** @defgroup PWREx_Exported_Functions_Group4 Memories Retention Functions
  * @brief    Memories retention functions
  *
@verbatim
 ===============================================================================
                     ##### Memories Retention Functions #####
 ===============================================================================
    [..]
      Several STM32U0 devices RAM are configurable to keep / lose RAMs content
      during Stop mode (Stop 0/1/2).
       (+) Retained content RAM in Stop modes are :
             (++) SRAM

@endverbatim
  * @{
  */

/**
  * @brief Enable Full SRAM content retention in Standby mode.
  * @retval None
  */
void HAL_PWREx_EnableSRAMContentRetention(void)
{
  MODIFY_REG(PWR->CR3, PWR_CR3_RRS, PWR_FULL_SRAM_RETENTION);
}

/**
  * @brief Disable SRAM content retention in Standby mode.
  * @retval None
  */
void HAL_PWREx_DisableSRAMContentRetention(void)
{
  CLEAR_BIT(PWR->CR3, PWR_CR3_RRS);
}

/**
  * @brief  Enable Flash Power Down.
  * @note   This API allows to enable flash power down capabilities in low power
  *         run, low power sleep and stop modes.
  * @param  PowerMode this can be a combination of following values:
  *           @arg @ref PWR_FLASHPD_LPRUN
  *           @arg @ref PWR_FLASHPD_LPSLEEP
  *           @arg @ref PWR_FLASHPD_STOP
  * @retval None
  */
void HAL_PWREx_EnableFlashPowerDown(uint32_t PowerMode)
{
  assert_param(IS_PWR_FLASH_POWERDOWN(PowerMode));

  PWR->CR1 |= PowerMode;
}

/**
  * @brief  Disable Flash Power Down.
  * @note   This API allows to disable flash power down capabilities in low power
  *         run, low power sleep and stop modes.
  * @param  PowerMode this can be a combination of following values:
  *           @arg @ref PWR_FLASHPD_LPRUN
  *           @arg @ref PWR_FLASHPD_LPSLEEP
  *           @arg @ref PWR_FLASHPD_STOP
  * @retval None
  */
void HAL_PWREx_DisableFlashPowerDown(uint32_t PowerMode)
{
  assert_param(IS_PWR_FLASH_POWERDOWN(PowerMode));

  PWR->CR1 &= ~PowerMode;
}

/**
  * @brief Enable Ultra Low Power BORL, BORH and PVD for STOP2 and Standby modes.
  * @note  All the other modes are not affected by this bit.
  * @retval None
  */
void HAL_PWREx_EnableUltraLowPowerMode(void)
{
  SET_BIT(PWR->CR3, PWR_CR3_ENULP);
}

/**
  * @brief Disable Ultra Low Power BORL, BORH and PVD for STOP2 and Standby modes.
  * @note  All the other modes are not affected by this bit
  * @retval None
  */
void HAL_PWREx_DisableUltraLowPowerMode(void)
{
  CLEAR_BIT(PWR->CR3, PWR_CR3_ENULP);
}
/**
  * @}
  */

